In [9]:
#pandas import하기
import pandas as pd

In [10]:
#1 데이터셋 영화 타이틀 데이터 셋
movies_title = pd.read_csv("c:/osh/movies_title.csv")

In [66]:
#2 title의 Data Frame을 만든다.

movies_title_sample = movies_title[["title","year"]]
movies_title_sample

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [68]:
#컬럼 확인
movies_title.columns

Index(['title', 'year'], dtype='object')

### 3 df필수 명령 8가지 실행

In [11]:
#1 첫 6개 데이터 조희 df.head()
movies_title.head(6)

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015
5               Gaiking II  2011

In [14]:
#2 마지막 n개 데이터는? df.tail()
movies_title.tail(3)

               title  year
215978         E yue  2005
215979  Lakota Girls  2015
215980  The Sting II  1983

In [13]:
#3 df 정보.. 건수, 컬럼수 df.shape
movies_title.shape

(215981, 2)

In [15]:
#4. 컬럼이름은? df.columns
movies_title.columns

Index(['title', 'year'], dtype='object')

In [16]:
#5. 데이터프레임 전체 구조(정보)는? df.info()
movies_title.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [17]:
#6. 결축치 확인 df.isnull()
movies_title.isnull()

        title   year
0       False  False
1       False  False
2       False  False
3       False  False
4       False  False
...       ...    ...
215976  False  False
215977  False  False
215978  False  False
215979  False  False
215980  False  False

[215981 rows x 2 columns]

In [18]:
movies_title.isnull().sum()  #컬럼별 sum

title    0
year     0
dtype: int64

In [19]:
movies_title.isnull().sum().sum()

0

In [20]:
#7. 요약 통계량 보기 df.describe()
movies_title.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [21]:
#8. 특정 컬럼(변수) df["컬럼명"].value_counts()
movies_title["title"]  #series

0                  The Rising Son
1               Ashes of Kukulcan
2         The Thousand Plane Raid
3                Crucea de piatra
4                          The 86
                   ...
215976             Le mouton noir
215977        Edge of the Unknown
215978                      E yue
215979               Lakota Girls
215980               The Sting II
Name: title, Length: 215981, dtype: object

In [22]:
#부르는 다른 방법
movies_title.title

0                  The Rising Son
1               Ashes of Kukulcan
2         The Thousand Plane Raid
3                Crucea de piatra
4                          The 86
                   ...
215976             Le mouton noir
215977        Edge of the Unknown
215978                      E yue
215979               Lakota Girls
215980               The Sting II
Name: title, Length: 215981, dtype: object

In [53]:
#4 전체 영화는 몇개인가?
movies_title_sample.value_counts().sum()

215981

In [69]:
#5. 가장 빠른 시기에 제작된 영화 2개를 찾아라.

movies_title_sample.min()

title    #1 Mamarazzi
year             1894
dtype: object

In [73]:
movies_title_sample["year"].value_counts()

2015    13978
2014     8209
2013     7664
2012     7273
2011     6844
        ...
1899        2
2024        2
1903        1
1897        1
1894        1
Name: year, Length: 124, dtype: int64

In [74]:
is_yeqr=movies_title_sample["year"] == '1894'
year1 = movies_title_sample[is_yeqr]
year1

Empty DataFrame
Columns: [title, year]
Index: []

In [50]:
#6. 제목이 "Hamlet"인 영화는 몇개인가?
is_Hamlet=movies_title_sample["title"] == 'Hamlet'
Hamlet_f = movies_title_sample[is_Hamlet]
Hamlet_f.value_counts().sum()

19

In [54]:
#6. Hamlet 영화 df
is_Hamlet=movies_title_sample["title"] == 'Hamlet'
Hamlet_f = movies_title_sample[is_Hamlet]
Hamlet_f

         title  year
5562    Hamlet  1948
26160   Hamlet  2016
37373   Hamlet  2015
42224   Hamlet  1990
43511   Hamlet  1910
68239   Hamlet  1954
85741   Hamlet  1976
87781   Hamlet  1987
87971   Hamlet  2000
91710   Hamlet  1921
114224  Hamlet  1969
154627  Hamlet  1913
163645  Hamlet  2009
169996  Hamlet  1964
186988  Hamlet  1996
192815  Hamlet  2011
195015  Hamlet  1911
205821  Hamlet  1973
207793  Hamlet  2014

In [58]:
#7 제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열

is_Treasure_Island=movies_title_sample["title"] == 'Treasure Island'
is_Treasure_Island_f = movies_title_sample[is_Treasure_Island]
is_Treasure_Island_f

                  title  year
47769   Treasure Island  1920
90175   Treasure Island  1950
103646  Treasure Island  1973
104714  Treasure Island  1972
166675  Treasure Island  1999
190792  Treasure Island  1985
191379  Treasure Island  1918
192917  Treasure Island  1934

In [60]:
#7 총합
is_Treasure_Island_f.value_counts().sum()

8

In [61]:
#7 제작년도 오름차순으로 나열
is_Treasure_Island_f.value_counts()

title            year
Treasure Island  1918    1
                 1920    1
                 1934    1
                 1950    1
                 1972    1
                 1973    1
                 1985    1
                 1999    1
dtype: int64

In [63]:
#8. 1950년에서 1959년사이에 만들어진 영화는 몇개인가?
is_moive1 = movies_title_sample['year'] >=1950
is_movie2 = movies_title_sample['year'] < 1960
subset_df = movies_title_sample[is_moive1 & is_movie2 ]
subset_df

                                         title  year
9                               Women's Prison  1955
37      La momia azteca contra el robot humano  1958
86                            Botta e risposta  1950
88                         Perdeu-se um Marido  1957
106                             Qiu yu can hua  1953
...                                        ...   ...
215856                    Tischlein, deck dich  1956
215890                        Some Like It Hot  1959
215915                             Black Widow  1951
215919                             Encrucijada  1956
215945                       Te sigo esperando  1952

[12120 rows x 2 columns]

In [64]:
subset_df.value_counts().sum()

12120